<?php

namespace Database\Seeders;

use App\Models\Landmark;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Location;

class LandmarkSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Landmark::create([
            'location_id' => Location::where('name','Bangkhen')->first()->id,
            'name' => 'sambhuraphajan',
            'thai_name' => 'สามบูรพาจารย์',
            'latitude' => '13.8421697',
            'longtitude' => '100.5730707',
            'image_url' => '/images/landmark/display/sambhuraphajan',
            'panorama_url' => '/images/landmark/panoramas/sambhuraphajan',
            'detail' => 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตบางเขน ถนนพหลโยธิน แขวงจอมพล เขตจตุจักร กรุงเทพมหานคร 10900',
            'description' => 'อนุสาวรีย์สามบูรพาจารย์ เป็นประติมากรรมรูปเหมือนครึ่งตัวของบุคคลสำคัญ 3 ท่าน ได้แก่ พระช่วงเกษตรศิลปการ หลวงสุวรรณวาจกกสิกิจ และหลวงอิงคศรีกสิการ ผู้มีบทบาทสำคัญในการก่อตั้งและพัฒนามหาวิทยาลัยเกษตรศาสตร์ สร้างขึ้นในปี พ.ศ. 2511 โดย อาจารย์ ประหยัด พงษ์ดำ เป็นผู้ปั้น'
        ]);
        Landmark::create([
            'location_id' => Location::where('name','Bangkhen')->first()->id,
            'name' => 'phrapirun',
            'thai_name' => 'พระพิรุณ',
            'latitude' => '13.8409383',
            'longtitude' => '100.5754932',
            'image_url' => '/images/landmark/display/phrapirun_bangkhen',
            'panorama_url' => '/images/landmark/panoramas/phrapirun_bangkhen',
            'detail' => 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตบางเขน ถนนพหลโยธิน แขวงจอมพล เขตจตุจักร กรุงเทพมหานคร 10900',
            'description' => 'พระพิรุณทรงนาค เป็นประติมากรรมรูปพระพิรุณทรงนาค 3 เศียร หล่อด้วยโลหะสีทอง สูงประมาณ 4 เมตร บนฐานหินแกรนิตสีดำ สร้างขึ้นในปี พ.ศ. 2498 โดย ศาสตราจารย์ ดร. นิตย์ นิรันดร์ นายช่างประจำมหาวิทยาลัยเกษตรศาสตร์ เป็นผู้ปั้น ใช้เวลาก่อสร้าง 1 ปี 7 เดือน พระพิรุณทรงนาค เป็นสัญลักษณ์ประจำมหาวิทยาลัยเกษตรศาสตร์ สื่อถึงความอุดมสมบูรณ์ ความรู้ ปัญญา และพลังอำนาจ เป็นที่เคารพศรัทธาของนิสิต คณาจารย์ บุคลากร และผู้มาเยือน นิสิตมักมาขอพรเพื่อความสำเร็จในการเรียนและการสอบ เป็นจุดถ่ายรูปยอดนิยม และใช้เป็นสถานที่จัดกิจกรรมต่างๆ ของมหาวิทยาลัย'
        ]);
        Landmark::create([
            'location_id' => Location::where('name','Bangkhen')->first()->id,
            'name' => 'sanchaomaepatcharee',
            'thai_name' => 'ศาลเจ้าแม่พัชรี',
            'latitude' => '13.8501328',
            'longtitude' => '100.5663824',
            'image_url' => '/images/landmark/display/sanchaomaepatcharee',
            'panorama_url' => '/images/landmark/panoramas/sanchaomaepatcharee',
            'detail' => 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตบางเขน ถนนพหลโยธิน แขวงจอมพล เขตจตุจักร กรุงเทพมหานคร 10900',
            'description' => 'ศาลเจ้าพ่อหนองผักชี เป็นศาลไม้เล็กๆ ตั้งอยู่ริมสระน้ำ บริเวณสวน 60 ปี มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตบางเขน เชื่อกันว่าเจ้าพ่อหนองผักชี เป็นผู้ปกปักรักษาคุ้มครองสถานที่แห่งนี้ นิสิตมักมาขอพรเพื่อความสำเร็จในการเรียน การสอบ และความปลอดภัย'
        ]);
        Landmark::create([
            'location_id' => Location::where('name','Bangkhen')->first()->id,
            'name' => 'lovingway',
            'thai_name' => 'เลิฟวิ่งเวย์',
            'latitude' => '13.84850',
            'longtitude' => '100.57188',
            'image_url' => '/images/landmark/display/lovingway',
            'panorama_url' => '/images/landmark/panoramas/lovingway',
            'detail' => 'มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตบางเขน ถนนพหลโยธิน แขวงจอมพล เขตจตุจักร กรุงเทพมหานคร 10900',
            'description' => 'สถานที่ยอดนิยมสำหรับนักศึกษา คณาจารย์ และพนักงานของมหาวิทยาลัยเกษตรศาสตร์ ใช้เป็นเส้นทางเดิน วิ่งออกกำลังกาย ปั่นจักรยาน รวมไปถึงพักผ่อนหย่อนใจ นอกจากนี้ ถนนสายนี้ยังเป็นสถานที่ถ่ายรูปยอดนิยม โดยเฉพาะในช่วงฤดูใบไม้ผลิและฤดูใบไม้ร่วง เมื่อต้นสนเปลี่ยนสี เป็นสถานที่ที่มีเสน่ห์และน่าจดจำ เป็นสถานที่ที่เหมาะสำหรับการมาเยือนไม่ว่าคุณจะเป็นนักศึกษา คณาจารย์ พนักงาน หรือผู้มาเยือนทั่วไป'
        ]);
        Landmark::create([
            'location_id' => Location::where('name','Kampansan')->first()->id,
            'name' => 'phrapirun',
            'thai_name' => 'พระพิรุณ',
            'latitude' => '14.02366',
            'longtitude' => '99.97631',
            'image_url' => '/images/landmark/display/phrapirun_kampansan',
            'panorama_url' => '/images/landmark/panoramas/phrapirun_kampansan',
            'detail' => 'สระพระพิรุณ มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตกำแพงแสน ตำบลกำแพงแสน อำเภอกำแพงแสน จังหวัดนครปฐม 73140',
            'description' => 'รูปปั้นพระพิรุณนี้ เป็นสัญลักษณ์ของมหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตกำแพงแสน สื่อถึงความอุดมสมบูรณ์ ความรู้ ปัญญา และพลังอำนาจ เป็นที่เคารพศรัทธาของนิสิต คณาจารย์ บุคลากร และผู้มาเยือน นิสิตมักมาขอพรเพื่อความสำเร็จในการเรียนและการสอบ เป็นจุดถ่ายรูปยอดนิยม และใช้เป็นสถานที่จัดกิจกรรมต่างๆ ของมหาวิทยาลัย'
        ]);
        Landmark::create([
            'location_id' => Location::where('name','Sriracha')->first()->id,
            'name' => 'phrapirun',
            'thai_name' => 'พระพิรุณ',
            'latitude' => '13.120321',
            'longtitude' => '100.918951',
            'image_url' => '/images/landmark/display/phrapirun_sriracha',
            'panorama_url' => '/images/landmark/panoramas/phrapirun_sriracha',
            'detail' => 'อนุสาวรีย์สามบูรพาจารย์ หรือ อนุสาวรีย์สามเสือแห่งเกษตร เป็นอนุสาวรีย์รูปเหมือนของสามบูรพาจารย์ผู้ริเริ่มสถาปนาวิทยาลัยเกษตรศาสตร์ คือพระช่วงเกษตรศิลปการ (ช่วง โลจายะ) หลวงสุวรรณวาจกกสิกิจ (ทองดี เรศานนท์) และหลวงอิงคศรีกสิการ (อินทรี จันทรสถิตย์) ประดิษฐาน ณ ลานอนุสาวรีย์สามบูรพาจารย์ หน้าสถาบันเกษตราธิการ สำนักงานปลัดกระทรวงเกษตรและสหกรณ์ ภายในมหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตบางเขน',
            'description' => 'รูปปั้นพระพิรุณนี้ ตั้งอยู่บนลานพระพิรุณ บริเวณหน้าอาคาร 1 มหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตศรีราชา เป็นรูปปั้นพระพิรุณ เทพเจ้าแห่งฝน ในศาสนาพราหมณ์-ฮินดู กำลังทรงนาค 3 เศียร มีความสูงประมาณ 4 เมตร สร้างขึ้นด้วยโลหะสีทอง บนฐานหินแกรนิตสีดำ สร้างขึ้นในปี พ.ศ. 2547 โดย รศ.ดร.วิโรจ อิ่มพิทักษ์ อธิการบดีมหาวิทยาลัยเกษตรศาสตร์ในสมัยนั้น เป็นผู้ริเริ่มสร้าง ใช้เวลาก่อสร้างประมาณ 1 ปี เป็นสัญลักษณ์ของมหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตศรีราชา สื่อถึงความอุดมสมบูรณ์ ความรู้ ปัญญา และพลังอำนาจ เป็นที่เคารพศรัทธาของนิสิต คณาจารย์ บุคลากร และผู้มาเยือน นิสิตมักมาขอพรเพื่อความสำเร็จในการเรียนและการสอบ เป็นจุดถ่ายรูปยอดนิยม และใช้เป็นสถานที่จัดกิจกรรมต่างๆ ของมหาวิทยาลัย'
        ]);
    }
}
