<?php

namespace Database\Seeders;

use App\Models\Landmark;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;
use App\Models\Location;

class LandmarkSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        Landmark::create([
            'location_id' => Location::where('name','Bangkhen')->first()->id,
            'name' => 'sambhuraphajan',
            'thai_name' => 'สามบูรพาจารย์',
            'latitude' => '13.8421697',
            'longtitude' => '100.5730707',
            'image_url' => '/images/landmark/display/sambhuraphajan',
            'panorama_url' => '/images/landmark/panoramas/sambhuraphajan',
            'detail' => 'อนุสาวรีย์สามบูรพาจารย์ หรือ อนุสาวรีย์สามเสือแห่งเกษตร เป็นอนุสาวรีย์รูปเหมือนของสามบูรพาจารย์ผู้ริเริ่มสถาปนาวิทยาลัยเกษตรศาสตร์ คือพระช่วงเกษตรศิลปการ (ช่วง โลจายะ) หลวงสุวรรณวาจกกสิกิจ (ทองดี เรศานนท์) และหลวงอิงคศรีกสิการ (อินทรี จันทรสถิตย์) ประดิษฐาน ณ ลานอนุสาวรีย์สามบูรพาจารย์ หน้าสถาบันเกษตราธิการ สำนักงานปลัดกระทรวงเกษตรและสหกรณ์ ภายในมหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตบางเขน',
            'description' => 'สามเสือเกษตร เป็นฉายาที่เจ้าพระยาธรรมศักดิ์มนตรี (สนั่น เทพหัสดิน ณ อยุธยา) ใช้เรียกแทนบุคคลสามคน ได้แก่ พระช่วงเกษตรศิลปการ (ช่วง โลจายะ) หลวงสุวรรณวาจกกสิกิจ (ทองดี เรศานนท์) และหลวงอิงคศรีกสิการ (อินทรี จันทรสถิตย์) ผู้มีคุณูปการในการพัฒนาวงการเกษตรไทยและเผยแพร่คุณประโยชน์ทางเกษตรกรรมไปสู่สาธารณชนซึ่งถือเป็นอาชีพหลักและอาชีพเดียวของราษฎรไทยในสมัยนั้นที่สร้างการเศรษฐกิจขึ้นอย่างเป็นระบบในประเทศไทย นอกจากนี้บุคคลทั้งสามยังเป็นผู้วางรากฐานการเกษตรและการศึกษาด้านเกษตรศาสตร์ของประเทศไทย อันนำไปสู่การสถาปนาสถาบันทางเกษตรศาสตร์เป็นการเฉพาะ และมีวิวัฒนาการมาเป็นมหาวิทยาลัยเกษตรศาสตร์ในปัจจุบันจำเดิมในทศวรรษที่สามของการครบรอบการสถาปนามหาวิทยาลัยเกษตรศาสตร์ ณ พื้นที่ลานด้านหน้าสถาบันเกษตราธิการ สำนักงานปลัดกระทรวงเกษตรและสหกรณ์ ได้มีการสถาปนาอนุสาวรีย์หลวงสุวรรณวาจกกสิกิจ (ทองดี เรศานนท์) ขึ้น โดยมีหม่อมเจ้าสิทธิพร กฤดากร ทรงประกอบพิธีเปิดอนุสาวรีย์ในวันที่ 2 กุมภาพันธ์ พ.ศ. 2511 ซึ่งเป็นวันครบรอบปีที่ 25 แห่งการสถาปนามหาวิทยาลัยเกษตรศาสตร์ ต่อมาในวาระการครบรอบปีที่ 50 แห่งการสถาปนามหาวิทยาลัยเกษตรศาสตร์ ได้มีการสร้างอนุสาวรีย์พระช่วงเกษตรศิลปการ (ช่วง โลจายะ) และหลวงอิงคศรีกสิการ (อินทรี จันทรสถิตย์) เพิ่มเติมให้เป็นอนุสาวรีย์ "สามเสือแห่งเกษตร" และมีพิธีเปิดในวันที่ 2 กุมภาพันธ์ พ.ศ. 2538'
        ]);
        Landmark::create([
            'location_id' => Location::where('name','Bangkhen')->first()->id,
            'name' => 'phrapirun',
            'thai_name' => 'พระพิรุณ',
            'latitude' => '13.8409383',
            'longtitude' => '100.5754932',
            'image_url' => '/images/landmark/display/phrapirun_bangkhen',
            'panorama_url' => '/images/landmark/panoramas/phrapirun_bangkhen',
            'detail' => 'อนุสาวรีย์สามบูรพาจารย์ หรือ อนุสาวรีย์สามเสือแห่งเกษตร เป็นอนุสาวรีย์รูปเหมือนของสามบูรพาจารย์ผู้ริเริ่มสถาปนาวิทยาลัยเกษตรศาสตร์ คือพระช่วงเกษตรศิลปการ (ช่วง โลจายะ) หลวงสุวรรณวาจกกสิกิจ (ทองดี เรศานนท์) และหลวงอิงคศรีกสิการ (อินทรี จันทรสถิตย์) ประดิษฐาน ณ ลานอนุสาวรีย์สามบูรพาจารย์ หน้าสถาบันเกษตราธิการ สำนักงานปลัดกระทรวงเกษตรและสหกรณ์ ภายในมหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตบางเขน',
            'description' => 'สามเสือเกษตร เป็นฉายาที่เจ้าพระยาธรรมศักดิ์มนตรี (สนั่น เทพหัสดิน ณ อยุธยา) ใช้เรียกแทนบุคคลสามคน ได้แก่ พระช่วงเกษตรศิลปการ (ช่วง โลจายะ) หลวงสุวรรณวาจกกสิกิจ (ทองดี เรศานนท์) และหลวงอิงคศรีกสิการ (อินทรี จันทรสถิตย์) ผู้มีคุณูปการในการพัฒนาวงการเกษตรไทยและเผยแพร่คุณประโยชน์ทางเกษตรกรรมไปสู่สาธารณชนซึ่งถือเป็นอาชีพหลักและอาชีพเดียวของราษฎรไทยในสมัยนั้นที่สร้างการเศรษฐกิจขึ้นอย่างเป็นระบบในประเทศไทย นอกจากนี้บุคคลทั้งสามยังเป็นผู้วางรากฐานการเกษตรและการศึกษาด้านเกษตรศาสตร์ของประเทศไทย อันนำไปสู่การสถาปนาสถาบันทางเกษตรศาสตร์เป็นการเฉพาะ และมีวิวัฒนาการมาเป็นมหาวิทยาลัยเกษตรศาสตร์ในปัจจุบันจำเดิมในทศวรรษที่สามของการครบรอบการสถาปนามหาวิทยาลัยเกษตรศาสตร์ ณ พื้นที่ลานด้านหน้าสถาบันเกษตราธิการ สำนักงานปลัดกระทรวงเกษตรและสหกรณ์ ได้มีการสถาปนาอนุสาวรีย์หลวงสุวรรณวาจกกสิกิจ (ทองดี เรศานนท์) ขึ้น โดยมีหม่อมเจ้าสิทธิพร กฤดากร ทรงประกอบพิธีเปิดอนุสาวรีย์ในวันที่ 2 กุมภาพันธ์ พ.ศ. 2511 ซึ่งเป็นวันครบรอบปีที่ 25 แห่งการสถาปนามหาวิทยาลัยเกษตรศาสตร์ ต่อมาในวาระการครบรอบปีที่ 50 แห่งการสถาปนามหาวิทยาลัยเกษตรศาสตร์ ได้มีการสร้างอนุสาวรีย์พระช่วงเกษตรศิลปการ (ช่วง โลจายะ) และหลวงอิงคศรีกสิการ (อินทรี จันทรสถิตย์) เพิ่มเติมให้เป็นอนุสาวรีย์ "สามเสือแห่งเกษตร" และมีพิธีเปิดในวันที่ 2 กุมภาพันธ์ พ.ศ. 2538'
        ]);
        Landmark::create([
            'location_id' => Location::where('name','Bangkhen')->first()->id,
            'name' => 'sanchaomaepatcharee',
            'thai_name' => 'สามบูรพาจารย์',
            'latitude' => '13.8501328',
            'longtitude' => '100.5663824',
            'image_url' => '/images/landmark/display/sanchaomaepatcharee',
            'panorama_url' => '/images/landmark/panoramas/sanchaomaepatcharee',
            'detail' => 'อนุสาวรีย์สามบูรพาจารย์ หรือ อนุสาวรีย์สามเสือแห่งเกษตร เป็นอนุสาวรีย์รูปเหมือนของสามบูรพาจารย์ผู้ริเริ่มสถาปนาวิทยาลัยเกษตรศาสตร์ คือพระช่วงเกษตรศิลปการ (ช่วง โลจายะ) หลวงสุวรรณวาจกกสิกิจ (ทองดี เรศานนท์) และหลวงอิงคศรีกสิการ (อินทรี จันทรสถิตย์) ประดิษฐาน ณ ลานอนุสาวรีย์สามบูรพาจารย์ หน้าสถาบันเกษตราธิการ สำนักงานปลัดกระทรวงเกษตรและสหกรณ์ ภายในมหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตบางเขน',
            'description' => 'สามเสือเกษตร เป็นฉายาที่เจ้าพระยาธรรมศักดิ์มนตรี (สนั่น เทพหัสดิน ณ อยุธยา) ใช้เรียกแทนบุคคลสามคน ได้แก่ พระช่วงเกษตรศิลปการ (ช่วง โลจายะ) หลวงสุวรรณวาจกกสิกิจ (ทองดี เรศานนท์) และหลวงอิงคศรีกสิการ (อินทรี จันทรสถิตย์) ผู้มีคุณูปการในการพัฒนาวงการเกษตรไทยและเผยแพร่คุณประโยชน์ทางเกษตรกรรมไปสู่สาธารณชนซึ่งถือเป็นอาชีพหลักและอาชีพเดียวของราษฎรไทยในสมัยนั้นที่สร้างการเศรษฐกิจขึ้นอย่างเป็นระบบในประเทศไทย นอกจากนี้บุคคลทั้งสามยังเป็นผู้วางรากฐานการเกษตรและการศึกษาด้านเกษตรศาสตร์ของประเทศไทย อันนำไปสู่การสถาปนาสถาบันทางเกษตรศาสตร์เป็นการเฉพาะ และมีวิวัฒนาการมาเป็นมหาวิทยาลัยเกษตรศาสตร์ในปัจจุบันจำเดิมในทศวรรษที่สามของการครบรอบการสถาปนามหาวิทยาลัยเกษตรศาสตร์ ณ พื้นที่ลานด้านหน้าสถาบันเกษตราธิการ สำนักงานปลัดกระทรวงเกษตรและสหกรณ์ ได้มีการสถาปนาอนุสาวรีย์หลวงสุวรรณวาจกกสิกิจ (ทองดี เรศานนท์) ขึ้น โดยมีหม่อมเจ้าสิทธิพร กฤดากร ทรงประกอบพิธีเปิดอนุสาวรีย์ในวันที่ 2 กุมภาพันธ์ พ.ศ. 2511 ซึ่งเป็นวันครบรอบปีที่ 25 แห่งการสถาปนามหาวิทยาลัยเกษตรศาสตร์ ต่อมาในวาระการครบรอบปีที่ 50 แห่งการสถาปนามหาวิทยาลัยเกษตรศาสตร์ ได้มีการสร้างอนุสาวรีย์พระช่วงเกษตรศิลปการ (ช่วง โลจายะ) และหลวงอิงคศรีกสิการ (อินทรี จันทรสถิตย์) เพิ่มเติมให้เป็นอนุสาวรีย์ "สามเสือแห่งเกษตร" และมีพิธีเปิดในวันที่ 2 กุมภาพันธ์ พ.ศ. 2538'
        ]);
        Landmark::create([
            'location_id' => Location::where('name','Bangkhen')->first()->id,
            'name' => 'lovingway',
            'thai_name' => 'เลิฟวิ่งเวย์',
            'latitude' => '13.84850',
            'longtitude' => '100.57188',
            'image_url' => '/images/landmark/display/lovingway',
            'panorama_url' => '/images/landmark/panoramas/lovingway',
            'detail' => 'อนุสาวรีย์สามบูรพาจารย์ หรือ อนุสาวรีย์สามเสือแห่งเกษตร เป็นอนุสาวรีย์รูปเหมือนของสามบูรพาจารย์ผู้ริเริ่มสถาปนาวิทยาลัยเกษตรศาสตร์ คือพระช่วงเกษตรศิลปการ (ช่วง โลจายะ) หลวงสุวรรณวาจกกสิกิจ (ทองดี เรศานนท์) และหลวงอิงคศรีกสิการ (อินทรี จันทรสถิตย์) ประดิษฐาน ณ ลานอนุสาวรีย์สามบูรพาจารย์ หน้าสถาบันเกษตราธิการ สำนักงานปลัดกระทรวงเกษตรและสหกรณ์ ภายในมหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตบางเขน',
            'description' => 'สามเสือเกษตร เป็นฉายาที่เจ้าพระยาธรรมศักดิ์มนตรี (สนั่น เทพหัสดิน ณ อยุธยา) ใช้เรียกแทนบุคคลสามคน ได้แก่ พระช่วงเกษตรศิลปการ (ช่วง โลจายะ) หลวงสุวรรณวาจกกสิกิจ (ทองดี เรศานนท์) และหลวงอิงคศรีกสิการ (อินทรี จันทรสถิตย์) ผู้มีคุณูปการในการพัฒนาวงการเกษตรไทยและเผยแพร่คุณประโยชน์ทางเกษตรกรรมไปสู่สาธารณชนซึ่งถือเป็นอาชีพหลักและอาชีพเดียวของราษฎรไทยในสมัยนั้นที่สร้างการเศรษฐกิจขึ้นอย่างเป็นระบบในประเทศไทย นอกจากนี้บุคคลทั้งสามยังเป็นผู้วางรากฐานการเกษตรและการศึกษาด้านเกษตรศาสตร์ของประเทศไทย อันนำไปสู่การสถาปนาสถาบันทางเกษตรศาสตร์เป็นการเฉพาะ และมีวิวัฒนาการมาเป็นมหาวิทยาลัยเกษตรศาสตร์ในปัจจุบันจำเดิมในทศวรรษที่สามของการครบรอบการสถาปนามหาวิทยาลัยเกษตรศาสตร์ ณ พื้นที่ลานด้านหน้าสถาบันเกษตราธิการ สำนักงานปลัดกระทรวงเกษตรและสหกรณ์ ได้มีการสถาปนาอนุสาวรีย์หลวงสุวรรณวาจกกสิกิจ (ทองดี เรศานนท์) ขึ้น โดยมีหม่อมเจ้าสิทธิพร กฤดากร ทรงประกอบพิธีเปิดอนุสาวรีย์ในวันที่ 2 กุมภาพันธ์ พ.ศ. 2511 ซึ่งเป็นวันครบรอบปีที่ 25 แห่งการสถาปนามหาวิทยาลัยเกษตรศาสตร์ ต่อมาในวาระการครบรอบปีที่ 50 แห่งการสถาปนามหาวิทยาลัยเกษตรศาสตร์ ได้มีการสร้างอนุสาวรีย์พระช่วงเกษตรศิลปการ (ช่วง โลจายะ) และหลวงอิงคศรีกสิการ (อินทรี จันทรสถิตย์) เพิ่มเติมให้เป็นอนุสาวรีย์ "สามเสือแห่งเกษตร" และมีพิธีเปิดในวันที่ 2 กุมภาพันธ์ พ.ศ. 2538'
        ]);
        Landmark::create([
            'location_id' => Location::where('name','Kampansan')->first()->id,
            'name' => 'phrapirun',
            'thai_name' => 'พระพิรุณ',
            'latitude' => '14.02366',
            'longtitude' => '99.97631',
            'image_url' => '/images/landmark/display/phrapirun_kampansan',
            'panorama_url' => '/images/landmark/panoramas/phrapirun_kampansan',
            'detail' => 'อนุสาวรีย์สามบูรพาจารย์ หรือ อนุสาวรีย์สามเสือแห่งเกษตร เป็นอนุสาวรีย์รูปเหมือนของสามบูรพาจารย์ผู้ริเริ่มสถาปนาวิทยาลัยเกษตรศาสตร์ คือพระช่วงเกษตรศิลปการ (ช่วง โลจายะ) หลวงสุวรรณวาจกกสิกิจ (ทองดี เรศานนท์) และหลวงอิงคศรีกสิการ (อินทรี จันทรสถิตย์) ประดิษฐาน ณ ลานอนุสาวรีย์สามบูรพาจารย์ หน้าสถาบันเกษตราธิการ สำนักงานปลัดกระทรวงเกษตรและสหกรณ์ ภายในมหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตบางเขน',
            'description' => 'สามเสือเกษตร เป็นฉายาที่เจ้าพระยาธรรมศักดิ์มนตรี (สนั่น เทพหัสดิน ณ อยุธยา) ใช้เรียกแทนบุคคลสามคน ได้แก่ พระช่วงเกษตรศิลปการ (ช่วง โลจายะ) หลวงสุวรรณวาจกกสิกิจ (ทองดี เรศานนท์) และหลวงอิงคศรีกสิการ (อินทรี จันทรสถิตย์) ผู้มีคุณูปการในการพัฒนาวงการเกษตรไทยและเผยแพร่คุณประโยชน์ทางเกษตรกรรมไปสู่สาธารณชนซึ่งถือเป็นอาชีพหลักและอาชีพเดียวของราษฎรไทยในสมัยนั้นที่สร้างการเศรษฐกิจขึ้นอย่างเป็นระบบในประเทศไทย นอกจากนี้บุคคลทั้งสามยังเป็นผู้วางรากฐานการเกษตรและการศึกษาด้านเกษตรศาสตร์ของประเทศไทย อันนำไปสู่การสถาปนาสถาบันทางเกษตรศาสตร์เป็นการเฉพาะ และมีวิวัฒนาการมาเป็นมหาวิทยาลัยเกษตรศาสตร์ในปัจจุบันจำเดิมในทศวรรษที่สามของการครบรอบการสถาปนามหาวิทยาลัยเกษตรศาสตร์ ณ พื้นที่ลานด้านหน้าสถาบันเกษตราธิการ สำนักงานปลัดกระทรวงเกษตรและสหกรณ์ ได้มีการสถาปนาอนุสาวรีย์หลวงสุวรรณวาจกกสิกิจ (ทองดี เรศานนท์) ขึ้น โดยมีหม่อมเจ้าสิทธิพร กฤดากร ทรงประกอบพิธีเปิดอนุสาวรีย์ในวันที่ 2 กุมภาพันธ์ พ.ศ. 2511 ซึ่งเป็นวันครบรอบปีที่ 25 แห่งการสถาปนามหาวิทยาลัยเกษตรศาสตร์ ต่อมาในวาระการครบรอบปีที่ 50 แห่งการสถาปนามหาวิทยาลัยเกษตรศาสตร์ ได้มีการสร้างอนุสาวรีย์พระช่วงเกษตรศิลปการ (ช่วง โลจายะ) และหลวงอิงคศรีกสิการ (อินทรี จันทรสถิตย์) เพิ่มเติมให้เป็นอนุสาวรีย์ "สามเสือแห่งเกษตร" และมีพิธีเปิดในวันที่ 2 กุมภาพันธ์ พ.ศ. 2538'
        ]);
        Landmark::create([
            'location_id' => Location::where('name','Sriracha')->first()->id,
            'name' => 'phrapirun',
            'thai_name' => 'พระพิรุณ',
            'latitude' => '13.120321',
            'longtitude' => '100.918951',
            'image_url' => '/images/landmark/display/phrapirun_sriracha',
            'panorama_url' => '/images/landmark/panoramas/phrapirun_sriracha',
            'detail' => 'อนุสาวรีย์สามบูรพาจารย์ หรือ อนุสาวรีย์สามเสือแห่งเกษตร เป็นอนุสาวรีย์รูปเหมือนของสามบูรพาจารย์ผู้ริเริ่มสถาปนาวิทยาลัยเกษตรศาสตร์ คือพระช่วงเกษตรศิลปการ (ช่วง โลจายะ) หลวงสุวรรณวาจกกสิกิจ (ทองดี เรศานนท์) และหลวงอิงคศรีกสิการ (อินทรี จันทรสถิตย์) ประดิษฐาน ณ ลานอนุสาวรีย์สามบูรพาจารย์ หน้าสถาบันเกษตราธิการ สำนักงานปลัดกระทรวงเกษตรและสหกรณ์ ภายในมหาวิทยาลัยเกษตรศาสตร์ วิทยาเขตบางเขน',
            'description' => 'สามเสือเกษตร เป็นฉายาที่เจ้าพระยาธรรมศักดิ์มนตรี (สนั่น เทพหัสดิน ณ อยุธยา) ใช้เรียกแทนบุคคลสามคน ได้แก่ พระช่วงเกษตรศิลปการ (ช่วง โลจายะ) หลวงสุวรรณวาจกกสิกิจ (ทองดี เรศานนท์) และหลวงอิงคศรีกสิการ (อินทรี จันทรสถิตย์) ผู้มีคุณูปการในการพัฒนาวงการเกษตรไทยและเผยแพร่คุณประโยชน์ทางเกษตรกรรมไปสู่สาธารณชนซึ่งถือเป็นอาชีพหลักและอาชีพเดียวของราษฎรไทยในสมัยนั้นที่สร้างการเศรษฐกิจขึ้นอย่างเป็นระบบในประเทศไทย นอกจากนี้บุคคลทั้งสามยังเป็นผู้วางรากฐานการเกษตรและการศึกษาด้านเกษตรศาสตร์ของประเทศไทย อันนำไปสู่การสถาปนาสถาบันทางเกษตรศาสตร์เป็นการเฉพาะ และมีวิวัฒนาการมาเป็นมหาวิทยาลัยเกษตรศาสตร์ในปัจจุบันจำเดิมในทศวรรษที่สามของการครบรอบการสถาปนามหาวิทยาลัยเกษตรศาสตร์ ณ พื้นที่ลานด้านหน้าสถาบันเกษตราธิการ สำนักงานปลัดกระทรวงเกษตรและสหกรณ์ ได้มีการสถาปนาอนุสาวรีย์หลวงสุวรรณวาจกกสิกิจ (ทองดี เรศานนท์) ขึ้น โดยมีหม่อมเจ้าสิทธิพร กฤดากร ทรงประกอบพิธีเปิดอนุสาวรีย์ในวันที่ 2 กุมภาพันธ์ พ.ศ. 2511 ซึ่งเป็นวันครบรอบปีที่ 25 แห่งการสถาปนามหาวิทยาลัยเกษตรศาสตร์ ต่อมาในวาระการครบรอบปีที่ 50 แห่งการสถาปนามหาวิทยาลัยเกษตรศาสตร์ ได้มีการสร้างอนุสาวรีย์พระช่วงเกษตรศิลปการ (ช่วง โลจายะ) และหลวงอิงคศรีกสิการ (อินทรี จันทรสถิตย์) เพิ่มเติมให้เป็นอนุสาวรีย์ "สามเสือแห่งเกษตร" และมีพิธีเปิดในวันที่ 2 กุมภาพันธ์ พ.ศ. 2538'
        ]);
    }
}
